<?php

// name,title,area,area_plus,dmax,davg,basin
$raw = "
Аннинское озеро;Аннинское;1,31;1,32;7,6;3,5;Западная_Двина
Белое озеро (Бояриновская волость);Белое;0,95;1,01;6,2;3,7;Западная_Двина
Белое озеро (Лавровская волость);Белое;4,68;4,68;27,0;10,0;Западная_Двина
Белое озеро (Мостищенская волость);Белое;2,94;2,94;13,0;7,2;Великая
Братилово;;3,75;3,76;5,6;3,1;Западная_Двина
Бронье;;2,04;2,07;4,0;2,0;Западная_Двина
Вятитерьво;;1,69;1,69;10,0;4,6;Западная_Двина
Глубокое (озеро);Глубокое;1,47;1,52;12,0;4,0;Западная_Двина
Долосцы (озеро);Долосцы;1,13;1,16;7,4;4,0;Западная_Двина
Залосемье;;1,30;1,30;6,0;2,7;Великая
Зародище;;0,98;0,98;2,0;1,3;Великая
Зеленец;;?;?;10,0;?;Западная_Двина
Зуевское;;1,10;1,10;3,7;1,5;Великая
Идрия;;0,99;0,99;2,0;1,5;Великая
Лива;;5,30;5,30;3,2;2,0;Великая
Мидино;;1,03;1,04;4,5;2,7;Западная_Двина
Могильно;;3,14;3,26;7,4;4,2;Великая
Мотяж;;2,34;2,42;8,0;3,0;Западная_Двина
Нечерица;;12,78;12,78;6,0;2,5;Западная_Двина
Нитятцы;;1,16;1,16;4,3;2,1;Западная_Двина
Ница;;2,45;2,45;3,0;2,0;Западная_Двина
Нища;;8,24;8,37;7,0;3,0;Западная_Двина
Озерявки;;0,97;0,97;6,5;2,5;Западная_Двина
Олбито;;7,63;7,69;7,0;3,7;Западная_Двина
Ормея;;2,01;2,01;2,4;1,4;Западная_Двина
Ороно;;5,79;5,81;20,0;6,0;Западная_Двина
Островно (Бояриновская волость);Островно;1,85;1,85;6,0;2,9;Великая
Островно (Лавровская волость);Островно;1,12;1,24;4,4;2,0;Западная_Двина
Осыно;;8,21;8,23;10,0;4,0;Западная_Двина
Прихабское;;1,22;1,25;3,8;1,4;Великая
Пустое Могильно;;1,56;1,56;7,0;3,0;Великая
Свибло;;13,46;13,72;11,0;3,5;Великая
Себежское;;15,82;15,99;18,0;5,0;Западная_Двина
Сутокское;;2,86;2,87;12,2;5,6;Великая
Чайки;;1,21;1,21;4,0;2,5;Западная_Двина
Шевино;;3,51;3,56;10,0;4,0;Великая
Ярица;;1,13;1,13;3,3;1,8;Западная_Двина
";

printf("<table class=\"table grid\">\n");
printf(" <thead>\n");
printf("  <tr>\n");
printf("   <th rowspan=\"2\">Название</th>\n");
printf("   <th rowspan=\"2\" class=\"number\">Площадь, км²</th>\n");
printf("   <th colspan=\"2\">Глубина, м</th>\n");
printf("  </tr>\n");
printf("  <tr>\n");
printf("   <th>ср.</th>\n");
printf("   <th>макс.</th>\n");
printf("  </tr>\n");
printf(" </thead>\n");
printf(" <tbody>\n");

$lines = explode("\n", trim($raw));
foreach ($lines as $line) {
    $cells = explode(";", trim($line));
    list($name, $title, $area, $area_plus, $dmax, $davg, $basin) = $cells;

    printf("  <tr>\n");
    if ($title)
        printf("   <td>[[%s|%s]]</td>\n", $name, $title);
    else
        printf("   <td>[[%s]]</td>\n", $name);
    printf("   <td class=\"number\">%s</td>\n", $area);
    printf("   <td class=\"number\">%s</td>\n", $davg);
    printf("   <td class=\"number\">%s</td>\n", $dmax);
    printf("  </tr>\n");
}

printf(" </tbody>\n");
printf("</table>\n");
